app/controllers/attendance_lists_controller.rb

SELECT `members`.`id` FROM `members` WHERE (status in (1,2)) ORDER BY id ASC
---
  def index

    #@attendance_lists = AttendanceList.all
    @schedules = Schedule.get_active_schedule()
    logger.debug(@schedules)

    @attendance_lists = Array.new
    @members = Member.where("status in (1,2)").order("id ASC").pluck(:id)

SELECT `attendance_lists`.* FROM `attendance_lists` WHERE `attendance_lists`.`id` = 0 LIMIT 1
---
  def show
    @attendance_list = AttendanceList.find(params[:id])

SELECT `attendance_lists`.* FROM `attendance_lists` WHERE `attendance_lists`.`id` = 1 LIMIT 1
---
  def edit
    @attendance_list = AttendanceList.find(params[:id])