app/controllers/home_controller.rb

SELECT `schedules`.* FROM `schedules` WHERE (kick_date >= '2014-01-17 09:35:05') ORDER BY kick_date ASC
---
  def index
    day=Time.now - 2.day
    @schedules = Schedule.where("kick_date >= ?", day).order("kick_date ASC")