app/controllers/members_controller.rb

SELECT `members`.* FROM `members`
---
  def index
      @member_status = Constants.member_status
      @members = Member.all