app/controllers/schedules_controller.rb

SELECT `schedules`.* FROM `schedules` WHERE (kick_date >= '2014-01-17 09:54:36') ORDER BY kick_date ASC
---
  def index
    day=Time.now - 2.day
    #@schedules = Schedule.all
    @schedules = Schedule.where("kick_date >= ?", day).order("kick_date ASC")

SELECT `schedules`.* FROM `schedules` WHERE `schedules`.`id` = 5 LIMIT 1
---
  def show
    @schedule = Schedule.find(params[:id])

INSERT INTO `schedules` (`contents`, `created_at`, `end_time`, `kick_date`, `open_flag`, `place`, `register`, `start_time`, `title`, `updated_at`) VALUES ('', '2014-01-19 09:56:41', '2014-01-19 21:30:00', '2014-02-08', 1, 'MSP千住', '東山', '2014-01-19 19:30:00', '2/8(土)練習', '2014-01-19 09:56:41')
---
  def create
    @schedule = Schedule.new(params[:schedule])

    respond_to do |format|
      if @schedule.save